---
kind: method
id: M:Autodesk.Revit.DB.ParameterSetIterator.#ctor
source: html/3081ad0d-f8a6-17e5-5b21-a54c17e03d6d.htm
---
# Autodesk.Revit.DB.ParameterSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ParameterSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.